angular.ng-template
atishay-jain.all-autocomplete
batisteo.vscode-django
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.codespaces
grapecity.gc-excelviewer
johnpapa.angular-essentials
johnpapa.vscode-peacock
kevinrose.vsc-python-indent
mf.vscode-styled-components
mikael.angular-beastcode
mrcrowl.easy-less
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vsliveshare.vsliveshare
njqdev.vscode-python-typehint
pkief.material-icon-theme
qwtel.sqlite-viewer
ritwickdey.liveserver
samuelcolvin.jinjahtml
shiro.pythonpack
slevesque.vscode-multiclip
styled-components.vscode-styled-components
tabnine.tabnine-vscode
tal7aouy.theme
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
wholroyd.jinja
wix.vscode-import-cost
xabikos.javascriptsnippets

cat extensions.txt | xargs -n 1 code --install-extension
